Run/Base_Cases_Run_Lubrication/Base_Case_Run/CFD/constant/couplingProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/


FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          couplingProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//===========================================================================//
// sub-models & settings
 
#include "dataHeadCFD"

modelType "A"; //A or B //none;

couplingInterval 10;

//depth 0;

voidFractionModel divided;//bigParticle;//centre; //

locateModel engine; //engineIB;//standard;//

meshMotionModel IBMeshMotion;//noMeshMotion;

regionModel allRegion;

dataExchangeModel twoWayMPI;//twoWayFiles;

IOModel basicIO;

probeModel off;

averagingModel dense;

clockModel standardClock;//off;

smoothingModel constDiffSmoothing; //off;// localPSizeDiffSmoothing;//constDiffSmoothing; //off;

forceModels
(
    KochHillDrag
    gradPForce
    viscForce
    Archimedes
    //surfaceTensionForce
    //GidaspowDrag
    //BeetstraDrag
    //SchillerNaumannDrag
    //DiFeliceDrag
    //interface
    //DEMbasedDrag
    //RongDrag
    //Archimedes
    //volWeightedAverage
    //totalMomentumExchange
    //particleCellVolume
    //fieldTimeAverage
    
    //IBSolverfiles
    //ShirgaonkarIB
    //ArchimedesIB
);

momCoupleModels
(
    implicitCouple
);

turbulenceModelType "turbulenceProperties";

//===========================================================================//
// sub-model properties


//========================================//
IBMeshMotionProps
{
    alpha 0.5;                 // relaxation parameter
    surfaceName
    (
        "./constant/triSurface/Stirrer.stl"
    );
    omega
    (
        $rotorSpeed // 2500 rpm
    );
    axis
    (
        (0 0 -1.)
    );
    centerOfRotation
    (
        (0. 0. 0.)
    );
    linearVelocity
    (
        (0. 0 0)
    );
    volumeMesh
    (
       5.2451523e-5
    );
    invariant
    (
        false
    );
    enableVolumeMeshCorrection
    (
    true
    );
    postProcessing true;
    postProcessingFrequency $torqueFreq;
}
//========================================//

localPSizeDiffSmoothingProps
{
    lowerLimit 0.1;
    upperLimit 1e10;
    dSmoothingLength 1.5e-1;
    Csmoothing    1.0; 
}

constDiffSmoothingProps
{
    lowerLimit 0.1;
    upperLimit 1e10;
    smoothingLength $smoothingLengthL;
}

implicitCoupleProps
{
    velFieldName "U";
    granVelFieldName "Us";
    voidfractionFieldName "voidfraction";
}

ArchimedesProps
{
    gravityFieldName "g";
    treatForceDEM true;
}

gradPForceProps
{
    pFieldName "p";
    voidfractionFieldName "voidfraction";
    velocityFieldName "U";
    //interpolation true;
}

viscForceProps
{
    velocityFieldName "U";
    //interpolation false;
    verbose	  true;
}

volWeightedAverageProps
{
    scalarFieldNames
    (
        voidfraction
    );
    vectorFieldNames
    (
    );
    upperThreshold 0.999;
    lowerThreshold 0;
    verbose true;
}

totalMomentumExchangeProps
{
    implicitMomExFieldName "Ksl";
    explicitMomExFieldName "none";
    fluidVelFieldName "U";
    granVelFieldName "Us";
}

GidaspowDragProps
{
    verbose true;
    velFieldName "U";
    voidfractionFieldName "voidfraction";
    interpolation true;
    phi 1;
}

DEMbasedDragProps
{
    velFieldName "U";
    voidfractionFieldName "voidfraction";
}

DiFeliceDragProps
{
    //verbose true;
    velFieldName "U";
    voidfractionFieldName "voidfraction";
    granVelFieldName "Us";
    //interpolation true;
}

SchillerNaumannDragProps
{
    //verbose true;
    velFieldName "U";
    voidfractionFieldName "voidfraction";
    granVelFieldName "Us";
    //interpolation true;
}

KochHillDragProps
{
    //verbose true;
    velFieldName "U";
    voidfractionFieldName "voidfraction";
    interpolation true;
    //forceSubModels
    //(
    //    ImExCorr
    //);
    implForceDEM true;
    //implForceDEMaccumulated true;
    //explicitCorr true;
}

BeetstraDragProps
{
    velFieldName "U";
    gravityFieldName "g";
    rhoParticle     2000.;
    voidfractionFieldName "voidfraction";
    interpolation ;
    useFilteredDragModel ;
    useParcelSizeDependentFilteredDrag ;
    k       0.05;
    aLimit  0.0;
//    verbose true;
}

RongDragProps
{
    verbose true;
    velFieldName "U";
    voidfractionFieldName "voidfraction";
    interpolation true;
    implForceDEM true;
    implForceDEMaccumulated true;
    granVelFieldName "Us";
}

virtualMassForceProps
{
    velFieldName "U";
}

particleCellVolumeProps
{
    upperThreshold 0.999;
    lowerThreshold 0.;
    verbose true;
}

fieldStoreProps
{
    scalarFieldNames
    (
    );

    vectorFieldNames
    (
        "U"
    );
}

oneWayVTKProps
{
    couplingFilename "vtk_out%4.4d.vtk";
    maxNumberOfParticles 30000;
}

twoWayFilesProps
{
    maxNumberOfParticles 10100;
    twoWayFilesProps
    maxNumberOfParticles 10000;
    DEMts 1e-06; //0.000004;//==============================================================================
}

centreProps
{
    alphaMin 0.1;
}

engineProps
{
    treeSearch true;
}

turboEngineM2MProps
{
    turboEngineProps
    {
        treeSearch true;
    }
}

dividedProps
{
    alphaMin 0.01;
   // porosity 0.5;
    //interpolation true;
}
//=====================================================================================================
twoWayMPIProps
{
    liggghtsPath "../DEM/in.liggghts_run";
}
twoWayM2MProps
{
    maxNumberOfParticles 10100;
    liggghtsPath "../DEM/in.liggghts_run";
}
//=====================================================================================================
surfaceTensionForceProps
{
}

trilinearProps
{
 alphaMin 0.01;
}

bigParticleProps
{
    alphaMin 0.01;
    maxCellsPerParticle 1000;
    porosity 64.0;
}

gradPForceSmoothProps
{
    pFieldName "p";
    voidfractionFieldName "voidfraction";
    velocityFieldName "U";
    smoothingModel "constDiffSmoothing";
    //interpolation true;
    constDiffSmoothingProps
    {
        lowerLimit 0.1;
        upperLimit 1e10;
        smoothingLength 20e-3;
    }

}

//========================================//
/*
ShirgaonkarIBProps
{
    velFieldName "U";
    pressureFieldName "p";
    verbose;
}

ArchimedesIBProps
{
    gravityFieldName "g";
    voidfractionFieldName "voidfractionNext";
}

twoWayFilesProps
{
    maxNumberOfParticles 10000;
    DEMts 1e-06; //0.000004;
}

twoWayMPIProps
{
    maxNumberOfParticles 10100;
    liggghtsPath "../DEM/in.liggghts_run";
}

IBProps
{
    maxCellsPerParticle 1000;
    alphaMin 0.30;
    scaleUpVol 1.0;
}

bigParticleProps
{
    maxCellsPerParticle 1000;
    alphaMin 0.30;
    scaleUpVol 1.0;
}
centreProlocalPSizeDiffSmoothingProps
{
    lowerLimit 0.1;
    upperLimit 1e10;
    dSmoothingLength 1.5e-1;
    Csmoothing    1.0; 
}

constDiffSmoothingProps
{
    lowerLimit 0.1;
    upperLimit 1e10;
    smoothingLength $smoothingLength;
}ps
{
    alphaMin 0.30;
}

dividedProps
{
    alphaMin 0.05;
    scaleUpVol 1.2;
}

engineIBProps
{
    engineProps
    {
        treeSearch false;
    }
    zSplit 8;
    xySplit 16;
}
*/

// ************************************************************************* //
